---
kind: property
id: P:Autodesk.Revit.DB.Macros.ModuleSettings.MacroLanguageType
source: html/13818528-0ea5-8798-1887-77de6b5f74da.htm
---
# Autodesk.Revit.DB.Macros.ModuleSettings.MacroLanguageType Property

The Macro language type.

## Syntax (C#)
```csharp
public MacroLanguageType MacroLanguageType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration